# St7GetHRACombinationLSAName

Returns the linear static results filename to be used with the harmonic time results.

long St7GetHRACombinationLSAName(long uID, char* FileName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

Full path and name for the linear static results file.